In [1]:
import pandas as pd

In [2]:
indexA = pd.read_csv('data/help_trends_indexA.csv', sep='\t')
indexA.head()

,month,Addiction,ADHD,Alcoholism,Aleppo,Amazon rainforest,Anger management,Anorexia,Anxiety,Australia fires,...,Self harm,Self-esteem,"Shortness of breath, covid",Standing Rock,Sudan,Suicidal ideation,Syria,Texas,Wildfire,Yemen
0,Jan 2015,11.29,4.65,8.63,0.0,0.00,0.66,1.99,1.66,0.66,...,1.99,1.66,0.0,0.0,0.33,0.33,0.66,1.00,0.0,0.0
1,Feb 2015,7.49,3.57,6.78,0.0,0.00,0.36,1.43,1.07,0.00,...,3.57,2.85,0.0,0.0,0.36,0.36,0.71,1.43,0.0,0.0
2,Mar 2015,12.96,4.54,7.45,0.0,0.00,1.30,3.24,0.65,0.00,...,2.27,4.21,0.0,0.0,0.00,0.32,1.30,2.92,0.0,0.0
3,Apr 2015,11.07,6.04,4.36,0.0,0.00,0.67,2.01,1.34,0.00,...,1.68,3.69,0.0,0.0,0.00,0.34,1.34,1.01,0.0,0.0
4,May 2015,10.71,4.54,5.84,0.0,0.32,0.97,0.97,1.95,0.00,...,4.54,3.89,0.0,0.0,0.00,0.65,0.32,3.24,0.0,0.0

In [3]:
indexB = pd.read_csv('data/help_trends_indexB.csv')
indexB.head()

,month,Addiction,ADHD,Alcoholism,Aleppo,Amazon rainforest,Anger management,Anorexia,Anxiety,Australia fires,...,Self harm,Self-esteem,"Shortness of breath, covid",Standing Rock,Sudan,Suicidal ideation,Syria,Texas,Wildfire,Yemen
0,Jan 2015,71.82,48.01,74.28,0.0,0.00,17.14,59.12,21.43,2.64,...,43.85,34.07,0.0,0.0,3.08,8.57,1.58,4.05,0.0,0.0
1,Feb 2015,47.67,36.86,58.34,0.0,0.00,9.21,42.36,13.82,0.00,...,78.54,58.58,0.0,0.0,3.31,9.21,1.70,5.81,0.0,0.0
2,Mar 2015,82.47,46.86,64.14,0.0,0.00,33.46,96.18,8.37,0.00,...,49.93,86.46,0.0,0.0,0.00,8.37,3.09,11.87,0.0,0.0
3,Apr 2015,70.44,62.38,37.53,0.0,0.00,17.32,59.75,17.32,0.00,...,36.93,75.74,0.0,0.0,0.00,8.66,3.20,4.10,0.0,0.0
4,May 2015,68.13,46.93,50.27,0.0,1.48,25.13,28.89,25.13,0.00,...,100.00,79.92,0.0,0.0,0.00,16.76,0.77,13.20,0.0,0.0

In [4]:
indexA_long = pd.melt(frame=indexA, id_vars=['month'], var_name='term', value_name='value')
indexA_long['month'] = pd.to_datetime(indexA_long['month'])
indexA_long

          month       term  value
0    2015-01-01  Addiction  11.29
1    2015-02-01  Addiction   7.49
2    2015-03-01  Addiction  12.96
3    2015-04-01  Addiction  11.07
4    2015-05-01  Addiction  10.71
...         ...        ...    ...
4769 2021-01-01      Yemen   0.47
4770 2021-02-01      Yemen   2.06
4771 2021-03-01      Yemen   1.13
4772 2021-04-01      Yemen   0.00
4773 2021-05-01      Yemen   0.00

[4774 rows x 3 columns]

In [5]:
indexB_long = pd.melt(frame=indexB, id_vars=['month'], var_name='term', value_name='value')
indexB_long['month'] = pd.to_datetime(indexB_long['month'])
indexB_long.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4774 entries, 0 to 4773
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   month   4774 non-null   datetime64[ns]
 1   term    4774 non-null   object
 2   value   4774 non-null   object
dtypes: datetime64[ns](1), object(2)
memory usage: 112.0+ KB

In [6]:
indexA_long.to_csv('data/indexA_long.csv', index=False)
indexB_long.to_csv('data/indexB_long.csv', index=False)